import type { GuaAnalyze } from '@/typing'

const analyzeDataArray: GuaAnalyze[] = [
  {
    grade: '上上卦', // 卦的好坏等级
    doubleName: '乾', // 卦名
    meaning: [
      {
        label: '象曰：',
        value: '困龙得水好运交，不由喜气上眉梢，一切谋望皆如意，向后时运渐渐高。',
      },
      {
        label: '事业：',
        value: '大吉大利，万事如意，心想事成，自有天佑，春风得意，事业如日中天。但阳气已达顶点，盛极必衰，务须提高警惕，小心谨慎。力戒骄傲，冷静处世，心境平和，如是则能充分发挥才智，保证事业成功。',
      },
      {
        label: '经商：',
        value: '十分顺利，有发展向上的大好机会。但切勿操之过急，宜冷静分析形势，把握时机，坚持商业道德，冷静对待中途出现的困难，定会有满意的结果。',
      },
      {
        label: '求名：',
        value: '潜在能力尚未充分发挥，只要进一步努力，克服骄傲自满情绪，进业修德，以渊博学识和高尚品质，成君子之名。',
      },
      {
        label: '外出：',
        value: '利于出行，结伴而行更佳。婚恋：阳盛阴衰，但刚柔可相济，形成美满结果。女性温柔者更佳。',
      },
      {
        label: '决策：',
        value: '可成就大的事业。坚持此卦的刚健、正直、公允的实质，修养德行，积累知识，坚定信念，自强不息，必能克服困难，消除灾难。',
      },
    ], // 卦的含义解析
  },
  {
    grade: '上上卦', // 卦的好坏等级
    doubleName: '坤', // 卦名
    meaning: [
      {
        label: '象曰：',
        value: '地势坤，君子以厚德载物。',
      },
      {
        label: '事业：',
        value: '诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰。切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行。取得朋友的关心和支持最为重要，在他人的合作下，共同完成事业。因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率、方正、含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功。',
      },
      {
        label: '经商：',
        value: '机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验。注意储存货物，待价而沽，处处小心为是。',
      },
      {
        label: '求名：',
        value: '比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥。',
      },
      {
        label: '外出：',
        value: '宜结伴而行。可去陌生的地方。',
      },
      {
        label: '婚恋：',
        value: '阴盛。以柔克刚，女方柔顺，美好姻缘，白头到老。',
      },
    ], // 卦的含义解析
  },
  {
    grade: '上上卦', // 卦的好坏等级
    doubleName: '屯', // 卦名
    meaning: [

    ], // 卦的含义解析
  },
  {
    grade: '中下卦', // 卦的好坏等级
    doubleName: '蒙', // 卦名
    meaning: [
      {
        label: '象曰：',
        value: '卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，做事必然受苦劳。',
      },
      {
        label: '事业：',
        value: '事业开始，混乱无序，危机四伏，以勇敢坚毅的行动可以扭转局面。然而必须接受严格教育，培养这种奋发图强的精神。务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地。',
      },
      {
        label: '经商：',
        value: '务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜。',
      },
      {
        label: '求名：',
        value: '必须接受良好的基础教育，陶冶情操。且动机纯正，可以达到目的。',
      },
      {
        label: '外出：',
        value: '等候有利时机再行动，等待期间应积极做准备。',
      },
      {
        label: '婚恋：',
        value: '注意考察对方品德，不可以金钱为诱铒。夫妻需相互宽容、理解。',
      },
      {
        label: '决策：',
        value: '有时会陷入迷惘困顿的境地，加上胆小、不果断，往往误事。如能接受长辈的教诲，甚至严酷的考验，抛弃疑惧的心理，等待适当时机，必然一帆风顺。',
      },
    ], // 卦的含义解析
  },
  {
    grade: '中下卦', // 卦的好坏等级
    doubleName: '需', // 卦名
    meaning: [
      {
        label: '象曰：',
        value: '明珠土埋日久深，无光无亮到如今，忽然大风吹土去，自然显露有重新。',
      },
      {
        label: '事业：',
        value: '行动之初，情况困难，必须以极大的耐心，创造条件和机会，行事光明磊落，观时待变，实现愿望。事情接近成功时，更应小心谨慎，切莫功亏一篑。',
      },
      {
        label: '经商：',
        value: '务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜。',
      },
      {
        label: '求名：',
        value: '时机尚不成熟，应耐心等待。这时应坚定信念，不为闲言流语所动摇，努力丰富自己，再求助可靠的人便可成功。',
      },
      {
        label: '外出：',
        value: '充分准备齐全后，可平安无事。',
      },
      {
        label: '婚恋：',
        value: '慎重，切不可草率行事，逐渐培养感情，以诚实、热情相待，会发生变故，仍可以有良好的结局。双方都应懂得以柔克刚的道理。',
      },
      {
        label: '决策：',
        value: '前途光明，有雄心大志，且可实现。为此需要积蓄实力，等待时机，大器晚成。本人具有坚强的意志，冷静的头脑。前进途中会遇到困难和险阻，必须十分谨慎，坦然对待小人的中伤，在灾祸面前能镇静自若。不轻举妄动，冷静选择方向。为人谦和、坦率，多有他人相助，促使事业成功。当时机，必然一帆风顺。',
      },
    ], // 卦的含义解析
  },
  {
    grade: '中下卦', // 卦的好坏等级
    doubleName: '讼', // 卦名
    meaning: [
      {
        label: '象曰：',
        value: '心中有事事难做，恰是二人争路走，雨下俱是要占先，谁肯让谁走一步。',
      },
      {
        label: '事业：',
        value: '起初顺利，有利可图，继而受挫，务必警惕，慎之又慎，不得固执已见，极力避免介入诉讼纠纷的争执之中。与其这样，不如退而让人，求得化解，安于正理，可免除意外之灾。陷入争讼，即使获胜，最后还得失去，得不偿失。',
      },
      {
        label: '经商：',
        value: '和气生财，吃亏是福。切勿追求不义之财。商业谈判坚持公正公平、互利的原则，尽量避免发生冲突。这样，会有好结果。',
      },
      {
        label: '求名：',
        value: '不利。自己尚缺乏竞争实力，应坚守纯正，隐忍自励，自强自勉，切莫逞强。依靠有地位的人的帮助，及早渡过难关。',
      },
      {
        label: '外出：',
        value: '途中多有变故，宜改日出行。',
      },
      {
        label: '婚恋：',
        value: '虽不尽人意，倒也般配，彼此理解，未尝不可。双方应以温和的方式处理生活。',
      },
      {
        label: '决策：',
        value: '争强好胜，不安于现状，为改变命运和超越他人而奋斗。头脑聪颖，反应敏捷，有贵人相助。但缺乏持之以恒的毅力，容易露出锋芒，得罪他人，带来诉讼之灾。宜承认现实，顺其自然，知足，适可而止。接受教训，引以为戒，可功成名就。',
      },
    ], // 卦的含义解析
  },
]

function getTargetAnalyze(doubleName: string): GuaAnalyze | null {
  return analyzeDataArray.find(item => item.doubleName === doubleName) || null
}

export default getTargetAnalyze
